# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     
   Description :
   Author :       ianchen
   date：          
-------------------------------------------------
   Change Activity:
                   2017/11/22:
-------------------------------------------------
"""
clean=['居民身份证', ' 610103196811083619', '居民身份证', ' 410105196907124417', '居民身份证', ' 610113196706170051', '营业执照', ' 91440300359482472D']
tzxx=['其他有限责任公司', '23.33%', '其他有限责任公司', '5.00%', '其他有限责任公司', '5.00%', '其他有限责任公司', '66.67%']
gj=['中国', '中国', '中国', '中国']
xm=['樊五洲', '王向东', '任永恒', '深圳市华屹投资管理有限公司']
gdxxdict = {}
zhenghe = {}
sb = 0
for j in range(0, len(clean), 2):
    gdxxdict["证件种类"] = clean[j]
    gdxxdict["证件号码"] = clean[j + 1]
    gdxxdict["经济性质"] = tzxx[j]
    gdxxdict["投资比例"] = tzxx[j + 1]
    gdxxdict["国籍"] = gj[sb]
    gdxxdict["股东名称"] = xm[sb]
    wc = gdxxdict
    sb += 1
    zhenghe["{}".format(sb)] = wc